Guide.md Structure modified
